# ClientName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ClientName Property
ParameterTypeId Class See Also
---
"Client Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ClientName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClientName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ClientName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace